class EmoticonConstants {

  static const List<String> UBB_CODE_ACNIANG = [
    "blink", "goodjob", "上", "中枪",
    "偷笑", "冷", "凌乱", "反对", "吓", "吻", "呆", "咦", "哦", "哭", "哭1",
    "哭笑", "哼", "喘", "喷", "嘲笑", "嘲笑1", "囧", "委屈", "心", "忧伤", "怒",
    "怕", "惊", "愁", "抓狂", "抠鼻", "擦汗", "无语", "晕", "汗", "瞎", "羞",
    "羡慕", "花痴", "茶", "衰", "计划通", "赞同", "闪光", "黑枪"
  ];

  static const List<String> UBB_CODE_ACNIANG_NEW = [
    "goodjob", "诶嘿", "偷笑", "怒", "笑",
    "那个…", "哦嗬嗬嗬", "舔", "鬼脸", "冷",
    "大哭", "哭", "恨", "中枪", "囧",
    "你看看你", "doge", "自戳双目", "偷吃", "冷笑",
    "壁咚", "不活了", "不明觉厉", "是在下输了", "你为猴这么",
    "干杯", "干杯2", "异议", "认真", "你已经死了",
    "你这种人…", "妮可妮可妮", "惊", "抢镜头", "yes",
    "有何贵干", "病娇", "lucky", "poi", "囧2",
    "威吓", "jojo立", "jojo立2", "jojo立3", "jojo立4",
    "jojo立5",
  ];

  static const List<String> UBB_CODE_PENGUIN = [
    "战斗力", "哈啤", "满分", "衰", "拒绝",
    "心", "严肃", "吃瓜", "嘣", "嘣2",
    "冻", "谢", "哭", "响指", "转身"
  ];

  static const List<String> UBB_IMAGE_PENGUIN = [
  "pg01.png", "pg02.png", "pg03.png", "pg04.png", "pg05.png",
  "pg06.png", "pg07.png", "pg08.png", "pg09.png", "pg10.png",
  "pg11.png", "pg12.png", "pg13.png", "pg14.png", "pg15.png"
  ];

  static const List<String> UBB_CODE_PST = [
    "举手", "亲", "偷笑", "偷笑2", "偷笑3",
    "傻眼", "傻眼2", "兔子", "发光", "呆",
    "呆2", "呆3", "呕", "呵欠", "哭",
    "哭2", "哭3", "嘲笑", "基", "宅",
    "安慰", "幸福", "开心", "开心2", "开心3",
    "怀疑", "怒", "怒2", "怨", "惊吓",
    "惊吓2", "惊呆", "惊呆2", "惊呆3", "惨",
    "斜眼", "晕", "汗", "泪", "泪2",
    "泪3", "泪4", "满足", "满足2", "火星",
    "牙疼", "电击", "看戏", "眼袋", "眼镜",
    "笑而不语", "紧张", "美味", "背", "脸红",
    "脸红2", "腐", "星星眼", "谢", "醉",
    "闷", "闷2", "音乐", "黑脸", "鼻血",
  ];

  static const List<String> UBB_CODE_DT = [
    "ROLL", "上", "傲娇", "叉出去", "发光",
    "呵欠", "哭", "啃古头", "嘲笑", "心",
    "怒", "怒2", "怨", "惊", "惊2",
    "无语", "星星眼", "星星眼2", "晕", "注意",
    "注意2", "泪", "泪2", "烧", "笑",
    "笑2", "笑3", "脸红", "药", "衰",
    "鄙视", "闲", "黑脸",//0-32
  ];



}